---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BendingDetailSegmentLengthsDisplayOptions.Text
enum: Autodesk.Revit.DB.Structure.BendingDetailSegmentLengthsDisplayOptions
source: html/b31596b6-b98a-e3ce-5a99-62589d74152a.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailSegmentLengthsDisplayOptions.Text

Display as texts